type_process_builder/src/process_builder_diagram.mermaid
%%{ init: { 'flowchart': {'defaultRenderer': 'tidy-tree' } } }%%
flowchart TD
    classDef hidden display: none;
    style Entry fill-opacity:0, stroke-opacity:0;
    Entry[" "]
    FinalizedSplitProcessSubgraph:::hidden
    subgraph FinalizedSplitProcessSubgraph[" "]
        FinalizedSplitProcess[FinalizedSplitProcess]
        finalized_split_cases_final{{exhaustive?}}
    end
    FlowingSplitProcessSubgraph:::hidden
    subgraph FlowingSplitProcessSubgraph[" "]
        FlowingSplitProcess[FlowingSplitProcess]
        flowing_split_cases{{exhaustive?}}
    end
    Entry -- "FinalBrick" --> FinalizedProcess
    FinalizedProcess -- "build" --> RunnableProcess
    Entry -- "LinearBrick" --> FlowingProcess
    FlowingProcess -- "LinearBrick or FlowingProcess" --> FlowingProcess
    FlowingProcess -- "FinalBrick or FinalizedProcess" --> FinalizedProcess
    Entry -- "SplitBrick" --> FinalizedSplitProcess
    FlowingProcess -- "SplitBrick" --> FinalizedSplitProcess
    FinalizedSplitProcess -- "FinalizedProcess" --> finalized_split_cases_final
    finalized_split_cases_final -- "cases left" --> FinalizedSplitProcess
    finalized_split_cases_final -- "all cases covered" --> FinalizedProcess
    FinalizedSplitProcess -- "FlowingProcess" --> FlowingSplitProcess
    FlowingSplitProcess -- "FinalizedProcess or FlowingProcess" --> flowing_split_cases
    flowing_split_cases -- "cases left" --> FlowingSplitProcess
    flowing_split_cases -- "all cases covered" --> FlowingProcess
    Entry ~~~ FlowingSplitProcess
